#include <stdio.h>

/*
C 的形参与实参
在 C 语言中，形参与实参虽然很简单，但是，是大家比较容易混淆的一个点，这里将为大家详细的讲解。
概念：从字面上理解，所谓形式参数即只只是声明了一个作为参数的变量，并未直接进行赋值使用，而实际参数则相反。

实参可以是变量，变量与表达式。实参与形参。实参与形参类型相同或赋值兼容
在调用函数过程中发生的实参与形参之间的数据传递，常称为“虚实结合”
在定义函数中制定的形参，在没有出现函数调用时不占用内存中的存储单元。在函数调用时才分配内存
将实参的值传递给形参,在执行函数时，由于形参已经有值。可以用形参进行运算。
通过return语句将函数值返回，若无返回值，则无return
调用结束后，形参被释放掉，实参保留原值（单向传值）
*/

int test(int,int); // 形参，只声明

int main()
{
    int a,b;
    printf("%d",test(5,3)); // 实参，已赋值
}

int test(int a,int b) // 形参
{
    a=a+b;
    return a;
}