

#06 C++对象与this指针  友元 运算符重载
1day

# （考点：全局函数做友元，类做友元）
# 1、编写一个程序包含两个类，一个为Time类通过display函数显示时间，一个为Date类通过display函数显示日期，要求能在一个函数中将时间和日期都打印出来。
# A.在函数体外声明一个display函数，在Date和Time中分别将此函数声明为友元函数。
# B.在Date中将Time声明成友元类，这样Time就能访问日期
1day/1job.cpp

# 2、实现一个学生类，即每个学生都有自己的属性，有姓名，学号，成绩。
#    重载运算符>，比较两个学生的成绩
# 对象1>对象2
1day/2job.cpp

# 有一个Time类，包含数据成员分秒，模拟秒表，每次走一秒，满六十秒就进一分钟，此时秒表又从0开始。输出分秒的值。（前置、后置自增运算符）
#  在main函数中做一个循环，每循环一次相当于秒钟走一次，Time对象++，显示运行之后当前时间
1day/3job.cpp

# 多继承 2020.12.8
2day

# 多态, 2020.12.9
3day/

# 函数模板
4day
4day/1job.cpp # 选择排序

# 类模板, string容器, 迭代器, 
5day

# 选出后缀不是.cpp或者.sh的文件
ls *[^p,sh]
