#include <stdio.h>
/*
 =	简单的赋值运算符，把右边操作数的值赋给左边操作数	C = A + B 将把 A + B 的值赋给 C
+=	加且赋值运算符，把右边操作数加上左边操作数的结果赋值给左边操作数	C += A 相当于 C = C + A
-=	减且赋值运算符，把左边操作数减去右边操作数的结果赋值给左边操作数	C -= A 相当于 C = C - A
*=	乘且赋值运算符，把右边操作数乘以左边操作数的结果赋值给左边操作数	C *= A 相当于 C = C * A
/=	除且赋值运算符，把左边操作数除以右边操作数的结果赋值给左边操作数	C /= A 相当于 C = C / A
%=	求模且赋值运算符，求两个操作数的模赋值给左边操作数	C %= A 相当于 C = C % A
<<=	左移且赋值运算符	C <<= 2 等同于 C = C << 2
>>=	右移且赋值运算符	C >>= 2 等同于 C = C >> 2
&=	按位与且赋值运算符	C &= 2 等同于 C = C & 2
^=	按位异或且赋值运算符	C ^= 2 等同于 C = C ^ 2
|=	按位或且赋值运算符	C |= 2 等同于 C = C | 2
 */
int main()
{
   int a = 21;
   int c ;
 
   c =  a;
   printf("Line 1: =  运算符实例，c 的值 = %d\n", c );
 
   c +=  a;
   printf("Line 2: += 运算符实例，c 的值 = %d\n", c );
 
   c -=  a;
   printf("Line 3: -= 运算符实例，c 的值 = %d\n", c );
 
   c *=  a;
   printf("Line 4: *= 运算符实例，c 的值 = %d\n", c );
 
   c /=  a;
   printf("Line 5: /= 运算符实例，c 的值 = %d\n", c );
 
   c  = 200;
   c %=  a;
   printf("Line 6: %= 运算符实例，c 的值 = %d\n", c );
 
   c <<=  2;
   printf("Line 7: <<= 运算符实例，c 的值 = %d\n", c );
 
   c >>=  2;
   printf("Line 8: >>= 运算符实例，c 的值 = %d\n", c );
 
   c &=  2;
   printf("Line 9: &= 运算符实例，c 的值 = %d\n", c );
 
   c ^=  2;
   printf("Line 10: ^= 运算符实例，c 的值 = %d\n", c );
 
   c |=  2;
   printf("Line 11 - |= 运算符实例，c 的值 = %d\n", c );
 return 0;
}
